# todo: Дано целое число. Если оно является положительным, то прибавить к нему 1;
# если отрицательным, то вычесть из него 2; если нулевым, то заме# нить его на 10.
# Вывести полученное число.

a = int(input('целое число'))
if a > 0:
    print(a+1)
 a < 0:
    print(a-2)
 a == 0:
    print(10)
